{
  "CurrentLocaleName": "French",
  "IntroductionPage_Title": "Introduction",
  "LocalizationCurrentProviderIs": "Le fournisseur de localisation actuel est:",
  "LocalizationProviderName": "Json",
  "MocaleDescription": "Framework de localisation pour .NET Maui",
  "MocaleTitle": "Mocale",
  "ExternalPrefixExplanation": "Strings prefixed with GR_ indicate they have been pulled from the external provider (GitHub.Raw), when the local cache expires if these values change, so will the text displayed!",
  "CityDescription_London": "Londres, capitale de l'Angleterre et du Royaume-Uni, est une ville du XXIe siècle dont l'histoire remonte à l'époque romaine. En son centre se dressent les imposantes chambres du Parlement, l'emblématique tour de l'horloge « Big Ben » et Westminster. Abbey, site des couronnements des monarques britanniques. De l'autre côté de la Tamise, la roue d'observation du London Eye offre une vue panoramique sur le complexe culturel de South Bank et sur toute la ville.",
  "CityDescription_Nottingham": "Nottingham est une ville de la région des Midlands au centre de l'Angleterre. Elle est connue pour son rôle dans la légende de Robin des Bois et pour le musée et la galerie d'art du château de Nottingham, reconstruits à plusieurs reprises depuis l'époque médiévale. Dans le quartier de Lace Market, Autrefois centre de l'industrie mondiale de la dentelle, le musée des Galeries de la Justice présente des expositions liées à la criminalité. Wollaton Hall est un manoir élisabéthain orné de jardins et d'un parc aux cerfs.",
  "CityDescription_Newcastle": "Newcastle upon Tyne, ou simplement Newcastle, est une ville et un arrondissement métropolitain de Tyne and Wear, en Angleterre. Il s'agit de l'arrondissement métropolitain le plus au nord de l'Angleterre, situé sur la rive nord de la rivière Tyne, en face de Gateshead, au sud. établissement peuplé de l'agglomération de Tyneside et du nord-est de l'Angleterre.",
  "CityDescription_Manchester": "Manchester est une ville majeure du nord-ouest de l'Angleterre avec un riche patrimoine industriel. Le système de canaux de la zone de conservation de Castlefield, datant du XVIIIe siècle, rappelle l'époque où la ville était une puissance textile, et les visiteurs peuvent retracer cette histoire au musée interactif de Science et industrie. Les chantiers navals revitalisés de Salford Quays abritent désormais l'Imperial War Museum North conçu par Daniel Libeskind et le centre culturel Lowry.",
  "BindingPage_Title": "Binding",
  "BindingPage_Heading": "Cette page montre comment utiliser Mocale pour répondre correctement aux changements de valeur et aux liaisons.",
  "BindingPage_CityDemo_Title": "Convertisseur de ville",
  "BindingPage_CityDemo_Heading": "Dans cette démo, nous avons un sélecteur avec certaines valeurs, lorsque la valeur change, nous souhaitons modifier le texte affiché. Il s'agit d'utiliser un convertisseur en coulisse pour modifier la localisation en fonction de la ville sélectionnée.",
  "BindingPage_CityDemo_PickerPlaceholder": "Sélectionnez une ville...",
  "BindingPage_CodeBehind_Title": "Code derrière la traduction",
  "BindingPage_CodeBehind_Heading": "Dans cet exemple, nous avons une étiquette dont la traduction sera définie via le code derrière en utilisant la méthode SetTranslation.",
  "BindingPage_CodeBehind_LabelKey": "Cette traduction a été définie dans du code C#, pas en Xaml !",
  "ParameterPage_Title": "Paramètres",
  "ParameterPage_Heading": "Ici, nous pouvons voir des exemples de formatage de chaîne à l'aide de Mocale. Utilisez la notation normale de format de chaîne .NET ({0}, {1}) et fournissez ces valeurs pour localiser les formats",
  "ParameterPage_SectionOne_Heading": "Localisations statiques",
  "ParameterPage_SectionOne_SubHeading": "Toutes les valeurs suivantes ont été localisées à l'aide de XML statique.",
  "ParameterPage_BasicStringFormat_Label": "Un format de chaîne de base",
  "ParameterPage_BasicStringFormat": "Bonjour {0}",
  "ParameterPage_LargeStringFormat_Label": "Un format de chaîne plus grand",
  "ParameterPage_LargeStringFormat": "Bonjour {0}, la date d'aujourd'hui est {1} et la météo est {2}°C",
  "ParameterPage_MultipleFormatsSameValue_Label": "Un format de chaîne avec la même valeur plusieurs fois",
  "ParameterPage_MultipleFormatsSameValue": "Bonjour {0}, Bonjour {0}, Bonjour {0}",
  "ParameterPage_SectionTwo_Heading": "Localisations liées",
  "ParameterPage_SectionTwo_SubHeading": "Toutes les valeurs suivantes ont été localisées à l'aide de liaisons. Si les valeurs liées sont mises à jour, les chaînes seront mises à jour en conséquence",
  "CodePage_Title": "Code",
  "CodePage_Heading": "Cette page est entièrement construite grâce au code derrière, vous pouvez voir des exemples de tout ce que Mocale a à offrir lorsque vous n'utilisez pas xaml!"
}
